app/Controllers/Home.php

  public function create()
  {
    $validation = \Config\Services::validation();

    $validation->setRules([
      'username' => 'required|min_length[3]|max_length[20]',
      'email' => 'required|valid_email',
      'password' => 'required|min_length[6]'
    ]);

    if (!$validation->withRequest($this->request)->run()) {
      return redirect()->back()->withInput()->with('errors', $validation->getErrors());
    }

    $data = [
      'username' => $this->request->getPost('username'),
      'email' => $this->request->getPost('email'),
      'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
      'is_disabled' => false
    ];
    $this->userModel->save($data);
---
INSERT INTO `users` (`username`, `email`, `password`, `is_disabled`, `created_at`, `updated_at`) VALUES ('jfksdnjfk', 'fsdfsdf@gmail.com', '$2y$10$GcrTDuP0SAzb6AngLj2mlOeIOuaL6a2DUZsk.23G68ICu33PHE1sK', 0, '2025-03-10 01:02:50', '2025-03-10 01:02:50')